## 예시

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql="SELECT * FROM vw_book;"

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0        1      2      3
0  1   축구의 역사   굿스포츠   7000
1  2  축구아는 여자    나무수  13000
2  3   축구의 이해  대한미디어  22000

## Q20

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql="SELECT * FROM vw_customer; "

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0    1         2              3
0  2  김연아   대한민국 서울  000-6000-0001
1  3  장미란  대한민국 강원도  000-7000-0001
2  5  박세리   대한민국 부산           None

## Q21

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT orderid,bookname,saleprice
FROM vw_orders
WHERE name='김연아';'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0                  1     2
0  3              피겨 교본  8000
1  9  Olympic Champions  7000

## Q22

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT *
FROM vw_customer;'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0    1        2
0  1  박지성  영국 맨체스타